Пансион83/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <attributes>
    <name>DateFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Пансион83/src/Catalogs/Мероприятия/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура BeforeWrite(pCancel)
	If ThisObject.DataExchange.Load Тогда
		Return;
	EndIf;
	If НЕ ЗначениеЗаполнено(DateFrom) Or НЕ ЗначениеЗаполнено(DateTo) Тогда
		ВызватьИсключение NStr("en='Event period should be filled!';ru='Период проведения мероприятия должен быть заполнен!';de='Der Zeitraum für die Durchführung von Veranstaltungen muss ausgefüllt sein!'");
	EndIf;
	If DateFrom > DateTo Тогда
		ВызватьИсключение NStr("en='Wrong event period! Date from is after date to.';ru='Период проведения мероприятия указан неверно! Дата начала периода позже даты окончания периода.';de='Der Zeitraum für die Durchführung von Veranstaltungen ist falsch angegeben! Das Datum des Zeitraumbeginns liegt nach dem Datum des Zeitraumendes.'");
	EndIf;
КонецПроцедуры //BeforeWrite

//-----------------------------------------------------------------------------
Процедура OnSetNewCode(pStandardProcessing, pPrefix)
	vPrefix = "";
	If ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяГостиница) Тогда
		vPrefix = СокрЛП(ПараметрыСеанса.ТекущаяГостиница.GetObject().pmGetPrefix());
	EndIf;
	If vPrefix <> "" Тогда
		pPrefix = vPrefix;
	EndIf;
КонецПроцедуры //OnSetNewCode
